QuantumLeaps/qpcpp/examples/rx/qk/renesas/dpp_qk_yrdkrx62n/iodefine_rx62n.h
/*********************************************************************
*
* Device     : RX/RX600/RX62N
*
* File Name  : ioedfine.h
*
* Abstract   : Definition of I/O Register. MSB
*
* History    : 1.00  (2010-02-18)  [Hardware Manual Revision : 0.5]
*
* NOTE       : THIS IS A TYPICAL EXAMPLE.
*
* Copyright(c) 2009 Renesas Technology Corp.
*               And Renesas Solutions Corp.,All Rights Reserved.
*
*********************************************************************/
/****************************************************************************/
/* rx62N Include File        Ver 0.2                                        */
/****************************************************************************/
/****************************************************************************/
/*  DATE        :Thu, Mar 4, 2010 AM 10:00:00                               */
/****************************************************************************/
#ifndef RX62NSFR_Header
#define RX62NSFR_Header
#pragma bit_order left
#pragma unpack

/**************************************************************************************************/
/*                                                                                                */
/*  DESCRIPTION :Definition of ICU Register                                                       */
/*  CPU TYPE    :RX62N                                                                            */
/*  HISTORY     :0.01  (2010-03-01)  [Hardware Manual Revision : 0.50]                            */
/*  NOTE        :This is a typical example.                                                       */
/*                                                                                                */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                                      */
/*     The following IR, DTCE, IEN, IPR MACRO functions simplify usage                            */
/*     A part of the interrupt source can be omitted.                                             */
/*     for example :                                                                              */
/*       IR(TPU0,TGI0A) = 0;     expands to:                                                      */
/*        (*(volatile struct st_icu __evenaccess *)0x87000).IR[ IR_TPU0_TGI0A ].BIT.IR = 0;       */
/*                                                                                                */
/*       DTCER(ICU,IRQ0) = 1;    expands to:                                                      */
/*        (*(volatile struct st_icu __evenaccess *)0x87000).DTCER[ DTCER_ICU_IRQ0 ].BIT.DTCE = 1; */
/*                                                                                                */
/*       IEN(CMT0,CMI0) = 1;     expands to:                                                      */
/*        (*(volatile struct st_icu __evenaccess *)0x87000).IER[ IER_CMT0_CMI0 ].BIT.IEN4 = 1;    */
/*                                                                                                */
/*       IPR(MTU0,TGIA0) = 3;    expands to:                                                      */
/*       IPR(MTU0,TGI  ) = 3; // TGIA0,TGIB0,TGIC0,TGID0 share IPR level.                         */
/*         (*(volatile struct st_icu __evenaccess *)0x87000).IPR[ IPR_MTU0_TGIA0 ].BIT.IPR = 3;   */
/*                                                                                                */
/*       IPR(CMT0,CMI0 ) = 1;    expands to:                                                      */
/*       IPR(CMT0,     ) = 1; // CMT0 uses single IPR for all sources                             */
/*         (*(volatile struct st_icu __evenaccess *)0x87000).IPR[ IPR_CMT0_CMI0 ].BIT.IPR = 1;    */
/*                                                                                                */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                                        */
/*     The number of vector is "(interrupt source, name)".                                        */
/*     for example :                                                                              */
/*       #pragma interrupt INT_MTU0_TGIA0(vect=VECT(MTU0,TGIA0))  expands to:                     */
/*          #pragma interrupt INT_MTU0_TGIA0(vect=114)                                            */
/*       #pragma interrupt INT_IRQ0      (vect=VECT(ICU ,IRQ0 ))  expands to:                     */
/*          #pragma interrupt INT_IRQ0      (vect=64)                                             */
/*       #pragma interrupt INT_CMT0_CMI0 (vect=VECT(CMT0,CMI0 ))  expands to:                     */
/*          #pragma interrupt INT_CMT0_CMI0 (vect=28)                                             */
/*                                                                                                */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC,MSTPCRD of SYSTEM Register                                    */
/*     The bit access operation is "MSTP(name)". The name that                                    */
/*     can be used is a macro name defined with "iodefine.h".                                     */
/*     for example :                                                                              */
/*       MSTP(TMR2) = 0; // TMR Unit 1 (TMR3/TMR2)                                                */
/*         (*(volatile struct st_system __evenaccess *)0x80000).MSTPCRA.BIT.MSTPA4 = 0;           */
/*       MSTP(PPG1) = 0; // PPG1                                                                  */
/*         (*(volatile struct st_system __evenaccess *)0x80000).MSTPCRA.BIT.MSTPA10 = 0;          */
/*       MSTP(MTU6) = 0; // MTU Unit 1 (TPU6 to TPU11)                                            */
/*         (*(volatile struct st_system __evenaccess *)0x80000).MSTPCRA.BIT.MSTPA8 = 0;           */
/*       MSTP(CMT3) = 0; // CMT Unit 1 (CMT2/CMT3)                                                */
/*         (*(volatile struct st_system __evenaccess *)0x80000).MSTPCRA.BIT.MSTPA14 = 0;          */
/*                                                                                                */
/*  Copyright(c) 2010 Renesas Technology Corp.                                                    */
/*               And Renesas Solutions Corp.,All Rights Reserved.                                 */
/*                                                                                                */
/**************************************************************************************************/
#define __IR(x)     ICU.IR[ IR ## x ].BIT.IR
#define  _IR(x)     __IR(x)
#define   IR(x,y)    _IR(_ ## x ## _ ## y)

#define __DTCE(x)   ICU.DTCER[ DTCER ## x ].BIT.DTCE
#define  _DTCE(x)   __DTCE(x)
#define   DTCE(x,y)  _DTCE(_ ## x ## _ ## y)

#define __IEN(x)    ICU.IER[ IER ## x ].BIT.IEN ## x
#define  _IEN(x)    __IEN(x)
#define   IEN(x,y)   _IEN(_ ## x ## _ ## y)

#define __IPR(x)    ICU.IPR[ IPR ## x ].BIT.IPR
#define  _IPR(x)    __IPR(x)
#define   IPR(x,y)   _IPR(_ ## x ## _ ## y)

#define __VECT(x)   VECT ## x
#define  _VECT(x)   __VECT(x)
#define   VECT(x,y)  _VECT(_ ## x ## _ ## y)

#define __MSTP(x)   MSTP ## x
#define  _MSTP(x)   __MSTP(x)
#define   MSTP(x)    _MSTP(_ ## x)

