QuantumLeaps/qpcpp/examples/rx/qk/renesas/dpp_qk_yrdkrx62n/iodefine_rx62n.h
struct st_edmac {
    union {
        unsigned long LONG;
        struct {
            unsigned long :25;
            unsigned long DE:1;
            unsigned long DL:2;
            unsigned long :3;
            unsigned long SWR:1;
        } BIT;
    } EDMR;
    unsigned char wk0[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long TR:1;
        } BIT;
    } EDTRR;
    unsigned char wk1[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long RR:1;
        } BIT;
    } EDRRR;
    unsigned char wk2[4];
    void *TDLAR;
    unsigned char wk3[4];
    void *RDLAR;
    unsigned char wk4[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :1;
            unsigned long TWB:1;
            unsigned long :3;
            unsigned long TABT:1;
            unsigned long RABT:1;
            unsigned long RFCOF:1;
            unsigned long ADE:1;
            unsigned long ECI:1;
            unsigned long TC:1;
            unsigned long TDE:1;
            unsigned long TFUF:1;
            unsigned long FR:1;
            unsigned long RDE:1;
            unsigned long RFOF:1;
            unsigned long :4;
            unsigned long CND:1;
            unsigned long DLC:1;
            unsigned long CD:1;
            unsigned long TRO:1;
            unsigned long RMAF:1;
            unsigned long :2;
            unsigned long RRF:1;
            unsigned long RTLF:1;
            unsigned long RTSF:1;
            unsigned long PRE:1;
            unsigned long CERF:1;
        } BIT;
    } EESR;
    unsigned char wk5[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :1;
            unsigned long TWBIP:1;
            unsigned long :3;
            unsigned long TABTIP:1;
            unsigned long RABTIP:1;
            unsigned long RFCOFIP:1;
            unsigned long ADEIP:1;
            unsigned long ECIIP:1;
            unsigned long TCIP:1;
            unsigned long TDEIP:1;
            unsigned long TFUFIP:1;
            unsigned long FRIP:1;
            unsigned long RDEIP:1;
            unsigned long RFOFIP:1;
            unsigned long :4;
            unsigned long CNDIP:1;
            unsigned long DLCIP:1;
            unsigned long CDIP:1;
            unsigned long TROIP:1;
            unsigned long RMAFIP:1;
            unsigned long :2;
            unsigned long RRFIP:1;
            unsigned long RTLFIP:1;
            unsigned long RTSFIP:1;
            unsigned long PREIP:1;
            unsigned long CERFIP:1;
        } BIT;
    } EESIPR;
    unsigned char wk6[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :20;
            unsigned long CNDCE:1;
            unsigned long DLCCE:1;
            unsigned long CDCE:1;
            unsigned long TROCE:1;
            unsigned long RMAFCE:1;
            unsigned long :2;
            unsigned long RRFCE:1;
            unsigned long RTLFCE:1;
            unsigned long RTSFCE:1;
            unsigned long PRECE:1;
            unsigned long CERFCE:1;
        } BIT;
    } TRSCER;
    unsigned char wk7[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long MFC:16;
        } BIT;
    } RMFCR;
    unsigned char wk8[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :21;
            unsigned long TFT:11;
        } BIT;
    } TFTR;
    unsigned char wk9[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :19;
            unsigned long TFD:5;
            unsigned long :3;
            unsigned long RFD:5;
        } BIT;
    } FDR;
    unsigned char wk10[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :30;
            unsigned long RNC:1;
            unsigned long RNR:1;
        } BIT;
    } RMCR;
    unsigned char wk11[8];
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long UNDER:16;
        } BIT;
    } TFUCR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long OVER:16;
        } BIT;
    } RFOCR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long TLB:1;
        } BIT;
    } IOSR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :13;
            unsigned long RFFO:3;
            unsigned long :13;
            unsigned long RFDO:3;
        } BIT;
    } FCFTR;
    unsigned char wk12[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :14;
            unsigned long PADS:2;
            unsigned long :10;
            unsigned long PADR:6;
        } BIT;
    } RPADIR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :27;
            unsigned long TIM:1;
            unsigned long :3;
            unsigned long TIS:1;
        } BIT;
    } TRIMD;
    unsigned char wk13[72];
    void *RBWAR;
    void *RDFAR;
    unsigned char wk14[4];
    void *TBRAR;
    void *TDFAR;
};

struct st_etherc {
    union {
        unsigned long LONG;
        struct {
            unsigned long :11;
            unsigned long TPC:1;
            unsigned long ZPE:1;
            unsigned long PFR:1;
            unsigned long RXF:1;
            unsigned long TXF:1;
            unsigned long :3;
            unsigned long PRCEF:1;
            unsigned long :2;
            unsigned long MPDE:1;
            unsigned long :2;
            unsigned long RE:1;
            unsigned long TE:1;
            unsigned long :1;
            unsigned long ILB:1;
            unsigned long RTM:1;
            unsigned long DM:1;
            unsigned long PRM:1;
        } BIT;
    } ECMR;
    unsigned char wk0[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :20;
            unsigned long RFL:12;
        } BIT;
    } RFLR;
    unsigned char wk1[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :26;
            unsigned long BFR:1;
            unsigned long PSRTO:1;
            unsigned long :1;
            unsigned long LCHNG:1;
            unsigned long MPD:1;
            unsigned long ICD:1;
        } BIT;
    } ECSR;
    unsigned char wk2[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :26;
            unsigned long BFSIPR:1;
            unsigned long PSRTOIP:1;
            unsigned long :1;
            unsigned long LCHNGIP:1;
            unsigned long MPDIP:1;
            unsigned long ICDIP:1;
        } BIT;
    } ECSIPR;
    unsigned char wk3[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :28;
            unsigned long MDI:1;
            unsigned long MDO:1;
            unsigned long MMD:1;
            unsigned long MDC:1;
        } BIT;
    } PIR;
    unsigned char wk4[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :31;
            unsigned long LMON:1;
        } BIT;
    } PSR;
    unsigned char wk5[20];
    union {
        unsigned long LONG;
        struct {
            unsigned long :12;
            unsigned long RMD:20;
        } BIT;
    } RDMLR;
    unsigned char wk6[12];
    union {
        unsigned long LONG;
        struct {
            unsigned long :27;
            unsigned long IPG:5;
        } BIT;
    } IPGR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long AP:16;
        } BIT;
    } APR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long MP:16;
        } BIT;
    } MPR;
    unsigned char wk7[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :24;
            unsigned long RPAUSE:8;
        } BIT;
    } RFCF;
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long TPAUSE:16;
        } BIT;
    } TPAUSER;
    union {
        unsigned long LONG;
        struct {
            unsigned long :24;
            unsigned long TXP:8;
        } BIT;
    } TPAUSECR;
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long BCF:16;
        } BIT;
    } BCFRR;
    unsigned char wk8[80];
    unsigned long MAHR;
    unsigned char wk9[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long :16;
            unsigned long MA:16;
        } BIT;
    } MALR;
    unsigned char wk10[4];
    unsigned long TROCR;
    unsigned long CDCR;
    unsigned long LCCR;
    unsigned long CNDCR;
    unsigned char wk11[4];
    unsigned long CEFCR;
    unsigned long FRECR;
    unsigned long TSFRCR;
    unsigned long TLFRCR;
    unsigned long RFCR;
    unsigned long MAFCR;
};


#define SYSTEM (*(volatile struct st_system __evenaccess *)0x80000)
#define BSC (*(volatile struct st_bsc __evenaccess *)0x81300)
#define DMACA0 (*(volatile struct st_dmaca0 __evenaccess *)0x82000)
#define DMACA1 (*(volatile struct st_dmaca1 __evenaccess *)0x82040)
#define DMACA2 (*(volatile struct st_dmaca1 __evenaccess *)0x82080)
#define DMACA3 (*(volatile struct st_dmaca1 __evenaccess *)0x820C0)
#define DMACA (*(volatile struct st_dmaca __evenaccess *)0x82200)
#define DTC (*(volatile struct st_dtc __evenaccess *)0x82400)
#define EXDMAC0 (*(volatile struct st_exdmac0 __evenaccess *)0x82800)
#define EXDMAC1 (*(volatile struct st_exdmac0 __evenaccess *)0x82840)
#define EXDMAC (*(volatile struct st_exdmac __evenaccess *)0x82A00)
#define ICU (*(volatile struct st_icu __evenaccess *)0x87000)
#define CMT (*(volatile struct st_cmt __evenaccess *)0x88000)
#define CMT0 (*(volatile struct st_cmt0 __evenaccess *)0x88002)
#define CMT1 (*(volatile struct st_cmt0 __evenaccess *)0x88008)
#define CMT2 (*(volatile struct st_cmt0 __evenaccess *)0x88012)
#define CMT3 (*(volatile struct st_cmt0 __evenaccess *)0x88018)
#define WDT (*(volatile union un_wdt __evenaccess *)0x88028)
#define IWDT (*(volatile struct st_iwdt __evenaccess *)0x88030)
#define AD0 (*(volatile struct st_ad __evenaccess *)0x88040)
#define AD1 (*(volatile struct st_ad __evenaccess *)0x88060)
#define DA (*(volatile struct st_da __evenaccess *)0x880C0)
#define PPG0 (*(volatile struct st_ppg0 __evenaccess *)0x881E6)
#define PPG1 (*(volatile struct st_ppg1 __evenaccess *)0x881F0)
#define TMR0 (*(volatile struct st_tmr0 __evenaccess *)0x88200)
#define TMR1 (*(volatile struct st_tmr1 __evenaccess *)0x88201)
#define TMR01 (*(volatile struct st_tmr01 __evenaccess *)0x88204)
#define TMR2 (*(volatile struct st_tmr0 __evenaccess *)0x88210)
#define TMR3 (*(volatile struct st_tmr1 __evenaccess *)0x88211)
#define TMR23 (*(volatile struct st_tmr01 __evenaccess *)0x88214)
#define SCI0 (*(volatile struct st_sci __evenaccess *)0x88240)
#define SCI1 (*(volatile struct st_sci __evenaccess *)0x88248)
#define SCI2 (*(volatile struct st_sci __evenaccess *)0x88250)
#define SCI3 (*(volatile struct st_sci __evenaccess *)0x88258)
#define SCI5 (*(volatile struct st_sci __evenaccess *)0x88268)
#define SCI6 (*(volatile struct st_sci __evenaccess *)0x88270)
#define CRC (*(volatile struct st_crc __evenaccess *)0x88280)
#define RIIC0 (*(volatile struct st_riic __evenaccess *)0x88300)
#define RIIC1 (*(volatile struct st_riic __evenaccess *)0x88320)
#define RSPI0 (*(volatile struct st_rspi __evenaccess *)0x88380)
#define RSPI1 (*(volatile struct st_rspi __evenaccess *)0x883A0)
#define MTU3 (*(volatile struct st_mtu3 __evenaccess *)0x88600)
#define MTU4 (*(volatile struct st_mtu4 __evenaccess *)0x88600)
#define MTUA (*(volatile struct st_mtu __evenaccess *)0x8860A)
#define MTU0 (*(volatile struct st_mtu0 __evenaccess *)0x88700)
#define MTU1 (*(volatile struct st_mtu1 __evenaccess *)0x88780)
#define MTU2 (*(volatile struct st_mtu2 __evenaccess *)0x88800)
#define MTU5 (*(volatile struct st_mtu5 __evenaccess *)0x88880)
#define POE (*(volatile struct st_poe __evenaccess *)0x88900)
#define MTU9 (*(volatile struct st_mtu3 __evenaccess *)0x88A00)
#define MTU10 (*(volatile struct st_mtu4 __evenaccess *)0x88A00)
#define MTUB (*(volatile struct st_mtu __evenaccess *)0x88A0A)
#define MTU6 (*(volatile struct st_mtu0 __evenaccess *)0x88B00)
#define MTU7 (*(volatile struct st_mtu1 __evenaccess *)0x88B80)
#define MTU8 (*(volatile struct st_mtu2 __evenaccess *)0x88C00)
#define MTU11 (*(volatile struct st_mtu5 __evenaccess *)0x88C80)
#define S12AD (*(volatile struct st_s12ad __evenaccess *)0x89000)
#define PORT0 (*(volatile struct st_port0 __evenaccess *)0x8C000)
#define PORT1 (*(volatile struct st_port1 __evenaccess *)0x8C001)
#define PORT2 (*(volatile struct st_port2 __evenaccess *)0x8C002)
#define PORT3 (*(volatile struct st_port3 __evenaccess *)0x8C003)
#define PORT4 (*(volatile struct st_port4 __evenaccess *)0x8C004)
#define PORT5 (*(volatile struct st_port5 __evenaccess *)0x8C005)
#define PORT6 (*(volatile struct st_port6 __evenaccess *)0x8C006)
#define PORT7 (*(volatile struct st_port7 __evenaccess *)0x8C007)
#define PORT8 (*(volatile struct st_port8 __evenaccess *)0x8C008)
#define PORT9 (*(volatile struct st_port9 __evenaccess *)0x8C009)
#define PORTA (*(volatile struct st_porta __evenaccess *)0x8C00A)
#define PORTB (*(volatile struct st_portb __evenaccess *)0x8C00B)
#define PORTC (*(volatile struct st_portc __evenaccess *)0x8C00C)
#define PORTD (*(volatile struct st_portd __evenaccess *)0x8C00D)
#define PORTE (*(volatile struct st_porte __evenaccess *)0x8C00E)
#define PORTF (*(volatile struct st_portf __evenaccess *)0x8C00F)
#define PORTG (*(volatile struct st_portg __evenaccess *)0x8C010)
#define IOPORT (*(volatile struct st_ioport __evenaccess *)0x8C100)
#define FLASH (*(volatile struct st_flash __evenaccess *)0x8C288)
#define RTC (*(volatile struct st_rtc __evenaccess *)0x8C400)
#define CAN0 (*(volatile struct st_can __evenaccess *)0x90200)
#define USB0 (*(volatile struct st_usb0 __evenaccess *)0xA0000)
#define USB1 (*(volatile struct st_usb0 __evenaccess *)0xA0200)
#define USB (*(volatile struct st_usb __evenaccess *)0xA0400)
#define EDMAC (*(volatile struct st_edmac __evenaccess *)0xC0000)
#define ETHERC (*(volatile struct st_etherc __evenaccess *)0xC0100)

